# Slim neck by GSConv for the YOLOv5, edited by AlanLi

# Parameters
nc:  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3
  - [30,61, 62,45, 59,119]  # P4
  - [116,90, 156,198, 373,326]  # P5

# YOLOv5 backbone
backbone:

# YOLOv5 neck
head:
  
  [[-1, 1, GSConv, [512, 1, 1]], # D1
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 'P4 in the backbone'], 1, Concat, [1]], 
   [-1, 3, VoVGSCSP, [512, False]], 

   [-1, 1, GSConv, [256, 1, 1]], # D2
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 'P3 in the backbone'], 1, Concat, [1]], 
   [-1, 3, VoVGSCSP, [256, False]],  # P3

   [-1, 1, GSConv, [256, 3, 2]],
   [[-1, 'D2'], 1, Concat, [1]],  
   [-1, 3, VoVGSCSP, [512, False]],  # P4

   [-1, 1, GSConv, [512, 3, 2]],
   [[-1, 'D1'], 1, Concat, [1]],  
   [-1, 3, VoVGSCSP, [1024, False]],  # P5

# YOLOv5 head

   [['P3', 'P4', 'P5'], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5 in the neck)
  ]
