# Slim neck by GSConv for the Scaled-YOLOv4, edited by AlanLi

# Parameters
nc:  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3
  - [30,61, 62,45, 59,119]  # P4
  - [116,90, 156,198, 373,326]  # P5

# scaled-YOLOv4 backbone
backbone:

# scaled-YOLOv4 neck
head:

  [[-1, 1, SPPCSP, [512]], # END of backbone
   [-1, 1, GSConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   ['P4 in the backbone', 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, VoVGSCSP, [256]], # D1 
   [-1, 1, GSConv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   ['P3 in the backbone', 1, GSConv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, VoVGSCSP, [128]], 
   [-1, 1, GSConv, [256, 3, 1]], # P3
   [-2, 1, GSConv, [256, 3, 2]],
   [[-1, 'D1'], 1, Concat, [1]],  # cat
   [-1, 3, VoVGSCSP, [256]], 
   [-1, 1, GSConv, [512, 3, 1]], # P4
   [-2, 1, GSConv, [512, 3, 2]],
   [[-1, 'END of backbone'], 1, Concat, [1]],  # cat
   [-1, 3, VoVGSCSP, [512]], 
   [-1, 1, GSConv, [1024, 3, 1]], # P5


# YOLOv4 head

   [['P3', 'P4', 'P5'], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5 in the neck)
  ]
